#include "condition.h"
#include "ipc.h"




/* 信号量 */

/************************************** 互斥量 **************************************/
/* usart句柄互斥量 */
/* socket句柄互斥量 */
/* 队列句柄互斥量 */

/************************************** 条件变量 **************************************/
/* 串口回复条件变量结构体，包含所有回复条件 */

/************************************** 队列 **************************************/
/* 1.串口发送队列 */
/* 2.socket发送队列 */
/* 3.控制队列 */
/* 4.子设备管理队列 */
/* 5.情境管理队列 */
/* 6.定时管理队列 */
/* 7.联动管理队列       */
/* 8.串口接收队列 */

void ipc_init(void)
{
	/* 互斥量初始化 */

	/* 条件变量初始化 */

	/* 队列初始化 */
}
