
#include "stdint.h"
#include "user_string.h"

/***************************************************************************************************
 * @fn      Srting_to_Hex
 *
 * @brief   将16进制字符串转换为16进制数组，支持输入大小写字符串
 *			"0011AB"-->0x00,0x11,0xAB 两个字符合并成一个16进制数据
 *
 * @param   dest：存放16进制数指针 src：字符串指针 length：字符串长度
 *			
 * @return  -1 字符串不完整   0转换成功
***************************************************************************************************/
int srting_to_hex(uint8_t *dest, uint8_t *src, uint8_t len)
{
  uint8_t i = 0;
  uint8_t ch;
  
  len = len/2;
  if(len%2)
  	return -1;
  
  for(i = 0; i<len; i++)
  {
    ch = src[2*i];
    dest[i] = ch - ((ch <= '9') ? '0':'7');
    
    ch = src[2*i+1];
    dest[i] = ((ch - ((ch <='9') ? '0':'7'))&0x0f) |(dest[i]<<4);
  }

  return 0;
}


/***************************************************************************************************
 * @fn      Hex_To_String
 *
 * @brief   将16进制数转换为字符串，其中字母为小写
 *			0x00,0x11,0xAB-->"0011ab"
 *
 * @param   dest：字符串指针 src 16进制数指针 len 16进制数字节数
 *			
 * @return  NULL
***************************************************************************************************/
void hex_to_string(uint8_t *dest, uint8_t *src, uint8_t len)
{
  uint8_t *xad;
  uint8_t i = 0;
  uint8_t ch;
  xad = src;
  for(i = 0; i<len; i++,xad++)
  {
    ch = (*xad >> 4) & 0x0f;
    dest[i<<1] = ch + ((ch < 10) ? '0':'W');
    
    ch = *xad & 0x0f;
    dest[(i<<1) + 1] = ch + ((ch < 10) ? '0':'W');
  }
}

/***************************************************************************************************
 * @fn      str_tou_32
 *
 * @brief   将十进制数的字符串转换为u32类型数
 *
 * @param   str:字符串
 *			
 * @return  u32类型数字
***************************************************************************************************/

uint32_t str_to_u32(char *str)
{
	uint32_t i=0,tmp=0;
	while(str[i]!='\0')
	{
		if(str[i]>='0'&&str[i]<='9')
		tmp=tmp*10+(str[i]-'0');
		i++;
	}
	return tmp;
}

/***************************************************************************************************
 * @fn      strim
 *
 * @brief   去除空格和不可见字符
 *
 * @param   str:字符串
 *			
 * @return  u32类型数字
***************************************************************************************************/
char *strim(char *str)
{
	char * tail = str;
	char * next = str;

	while(*next)
	{
    	if(*next >32)
		{
			if(tail < next)
				*tail = *next;
			tail++;
		}
		next++;
	}
	*tail = '\0';

	return str;
}
